app/Http/Helpers/Common.php

    public static function meta($url, $field)
    {
        $metas = Meta::where('url', $url);

        if($metas->count())
            return $metas->first()->$field;
---
select count(*) as aggregate from `seo_metas` where `url` = '/'
select * from `seo_metas` where `url` = '/' limit 1