app/Helpers/helpers.php

select * from `language` where `status` = 1
---
function getLanguages() {
    $languages = [];
    foreach(Language::where('status', 1)->get() as $each) {

select `code`, `name`, `symbol` from `currency` where `status` = 'Active'
---
function getCurrencies() {
    return Currency::where('status', '=', 'Active')->select('code', 'name', 'symbol')->get();

select * from `language` where `short_name` = 'en' limit 1
---
function flagsShortcodes($name){
    $language = App\Models\Language::where('short_name', '=', $name)->first();

select `value` from `settings` where (`type` = 'preferences' and `name` = 'money_format') limit 1
---
function currencySymbolPosition()
{
    $position = Settings::where(['type' => 'preferences', 'name' => 'money_format'])->first(['value'])->value;