app/Http/Controllers/HomeController.php

    public function index(Request $request)
    {

        $data['starting_cities'] = StartingCities::getAll();
        $data['banners']              = Banners::all();
        $data['properties']          = Properties::recommendedHome();
        $data['testimonials']        = Testimonials::getAll();
        $sessionLanguage             = Session::get('language');
        $language                    = Settings::where(['name' => 'default_language', 'type' => 'general'])->first();
---
select * from `banners`
select * from `settings` where (`name` = 'default_language' and `type` = 'general') limit 1