app/Models/Properties.php

select * from `property_price` where `property_price`.`property_id` in (1)
select * from `users` where `users`.`id` in (1)
---
    public static function recommendedHome()
    {
        $data = parent::where('status', 'listed')
                        ->with('users','property_price', 'property_address')
                        ->where('recomended', '1')
                        ->take(8)
                        ->inRandomOrder()
                        ->get();

select * from `property_photos` where `property_id` = 1 and `cover_photo` = 1 limit 1
---
    public function getCoverPhotoAttribute()
    {
        $cover = PropertyPhotos::where('property_id', $this->attributes['id'])->where('cover_photo', 1)->first();

select count(*) as aggregate from `reviews` where `property_id` = 1 and `reviewer` = 'guest'
---
     public function getGuestReviewAttribute()
    {
        $reviews = Reviews::where('property_id', $this->attributes['id'])->where('reviewer', 'guest');

        return $reviews->count();