app/Models/PropertyPrice.php

    public function currency_convert($field)
    {
        $rate = Currency::whereCode($this->attributes['currency_code'])->first()->rate;
        if ($rate == 0) {
            return 0;
        }

        $unit = $this->attributes[$field] / $rate;

        $default_currency = Currency::where('default', 1)->first()->code;

        $session_rate = Currency::whereCode((\Session::get('currency')) ? \Session::get('currency') : $default_currency)->first()->rate;
---
select * from `currency` where `code` = 'USD' limit 1
select * from `currency` where `default` = 1 limit 1