app/Models/Properties.php

select * from `addresses` where `addresses`.`addressable_id` in (1) and `addresses`.`addressable_type` = 'App\Models\Properties'
---
    public function getPropertyAddressAttribute(){
        $result = Address::where('addressable_id', $this->attributes['id'])->where('addressable_type', 'App\Models\Properties')->first();